Revit 2026 API

# FailureDefinitionCreateFailureDefinition Method

---

Creates an instance of a FailureDefinition.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static FailureDefinition CreateFailureDefinition(
	FailureDefinitionId id,
	FailureSeverity severity,
	string messageString
)
```
```vb
Public Shared Function CreateFailureDefinition (
	id As FailureDefinitionId,
	severity As FailureSeverity,
	messageString As String
) As FailureDefinition
```
```cpp
public:
static FailureDefinition^ CreateFailureDefinition(
	FailureDefinitionId^ id,
	FailureSeverity severity,
	String^ messageString
)
```
```fsharp
static member CreateFailureDefinition :
        id : FailureDefinitionId *
        severity : FailureSeverity *
        messageString : string -> FailureDefinition
```

#### Parameters

id FailureDefinitionId
     Unique identifier of the failure.
severity FailureSeverity
     The severity of the failure. Cannot be FailureSeverity::None.
messageString String
     A user-visible string describing the failure.

#### Return Value

FailureDefinition The created FailureDefinition instance.

| Exception | Condition |
| --- | --- |
| ArgumentException | The id of failure definition is not valid. -or- The id of failure definition is already used to register another FailureDefinition. -or- The severity of failures cannot be FailureSeverity::None. -or- Message string is empty or contains invalid characters. |
| ArgumentNullException | A non-optional argument was null |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

The newly created FailureDefinition will be added to the FailureDefinitionRegistry. Because FailureDefinition could only be registered when Revit starting up, this function cannot be used after Revit has already started. Throws InvalidOperationException if invoked after Revit start-up is completed.

#### Reference

FailureDefinition Class

Autodesk.Revit.DB Namespace